# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names.drop(columns = ['Unnamed: 0', 'Id'], inplace = True)

### Step 6. Is there more male or female names in the dataset?

In [10]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [16]:
baby_names.groupby('Gender').sum()

              Year     Count
Gender
F       1122736288  16380293
M        919255329  19041199

### Step 7. Group the dataset by name and assign to names

In [18]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [ ]:
len(names)

In [199]:
g = baby_names.groupby(['Gender', 'Name']).agg({'Count':'sum'})
   
# g.sort_values([('Gender', 'Count')], ascending=False)
# g    
    
g2 = g.reset_index().sort_values(['Gender','Count'], ascending=[0,0]).set_index(['Gender','Name'])
g2

                  Count
Gender Name
M      Jacob     242706
       Michael   214228
       Ethan     209153
       William   197796
       Joshua    191444
...                 ...
F      Zyairah        5
       Zyan           5
       Zyeria         5
       Zykeriah       5
       Zykierra       5

[18941 rows x 1 columns]

In [196]:
g

                   Count
Gender Name
F      Aadhya        453
       Aadya         300
       Aahana        124
       Aahna           7
       Aaima           5
...                  ...
M      Zymire         10
       Zyon         1058
       Zyquan         42
       Zyquavious      6
       Zyren           6

[18941 rows x 1 columns]

### Step 9. What is the name with most occurrences?

In [176]:
aa = names.sum().sort_values(by = 'Count',ascending = False)

### Step 10. How many different names have the least occurrences?

In [180]:
aa.loc[aa['Count'] == 5]

            Year  Count
Name
Ithzel      2004      5
Varick      2014      5
Lavi        2014      5
Toma        2011      5
Tobechukwu  2010      5
...          ...    ...
Eniola      2012      5
Atlantis    2005      5
Marci       2004      5
Simarpreet  2011      5
Nita        2007      5

[2578 rows x 2 columns]

### Step 11. What is the median name occurrence?

In [184]:
aa[aa['Count'] == 49]

           Year  Count
Name
Zuleima   14050     49
Vita      14075     49
Aziah     16073     49
Kaedence  18088     49
Antonina  18081     49
...         ...    ...
Mckynzie  14068     49
Yoni      16060     49
Hareem    14090     49
Jkwon     14028     49
Nazier    16061     49

[66 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [185]:
aa.std()

Year     245161.817178
Count     11006.069468
dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [186]:
aa.describe()

               Year          Count
count  1.763200e+04   17632.000000
mean   1.158117e+05    2008.932169
std    2.451618e+05   11006.069468
min    2.004000e+03       5.000000
25%    4.017000e+03      11.000000
50%    1.606100e+04      49.000000
75%    7.846425e+04     337.000000
max    2.233993e+06  242874.000000

In [200]:
baby_names.groupby(['Gender', 'Name']).agg({'Count':'sum'})

                   Count
Gender Name
F      Aadhya        453
       Aadya         300
       Aahana        124
       Aahna           7
       Aaima           5
...                  ...
M      Zymire         10
       Zyon         1058
       Zyquan         42
       Zyquavious      6
       Zyren           6

[18941 rows x 1 columns]